{
    "Projetos voltados ao usuário": {

        "Melhoria para carroças de catadores": {

            "descricao": "Com o proposito de melhorar o bem estar e as condições de trabalho dos catadores, os alunos foram divididos em grupos, com objetivo de desenvolver uma ideia acessível de melhoria à carroça. Para definir as necessidades dos carroceiros, os grupos foram às ruas entrevistá-los e coletar informações sobre as carroças. A avaliação final foi sobre um protótipo de carroça construido pelos alunos no FabLab, cujo representava as ideias de cada grupo. Durante o período de férias, as ideias foram efetivadas e aplicadas em carroças de catadores escolhidos entre todos aqueles que foram entrevistados pelos alunos. O projeto foi promovido com parceria do Insper com o movimento Pimp My Carroça.",
            "goal": [
                "Identificar e abordar problemas de design",
                "Aplicar métodos formais para facilitar o processo de design",
                "documentar o processo de design",
                "Representar um objeto graficamente por meio de sketch",
                "Apresentar oralmente os resultados do processo de design",
                "Utilizar técnicas de fabricação digital para prototipar soluções",
                "Compreender o projeto de design como forma de aprendizado pelofazer (hands-on)",
                "Entender o trabalho em equipe como importante fator no processo de design, com crescente consciência dos papéis a serem executados durante o projeto"
            ],
            "image": "carroca.jpg",
            "materia": "Natureza do Design",
            "semestre": "Semestre de engenharia",
            "titulo": "Melhoria para carroça de catadores"
        },
        "Projeto final de Co-Design de Aplicativos": {

            "descricao": "Os alunos devem criar um aplicativo para SmartPhones",
            "goal": [
                "Estruturar personas a partir de entrevistas",
                "Estruturar questões de projeto a partir de personas",
                "Criar conceitos de aplicativo a partir de questões de projeto",
                "Estruturar cenários a partir de conceitos de aplicativo",
                "Seguir protocolos de teste com usuários",
                "Avaliar resultados de testes",
                "Articular decisões de design"
            ],
            "image": "codes.jpg",
            "materia": "Co-Design de Aplicativos",
            "semestre": "2° Semestre de Engenharia",
            "titulo": "Projeto Final de Co-Design de Aplicativos"
        },
        "Inovação incremental para empresa existente": {
            "descricao": "É a introdução de qualquer tipo de melhoria em um produto, processo ou organização da produção dentro de uma empresa, sem alteração na estrutura industrial.",
            "goal": [
                "Detectar problemas dentro da empresa.",
                "Seguir protocolos da empresa."
            ],
            "image": "empresa.jpg",
            "materia": "Eletiva",
            "semestre": "Livre escolha",
            "titulo": "Inovação incremental para empresa existente"
        },
        "Modelo de negócios para startup nova": {
            "descricao": "Desenvolvimento de novas ideias para empresas que buscam inovação no mercado atual.",
            "goal": [
                "Aprender a modelar ideias em função empresarias",
                "Não fugir da proposta da empresa"
            ],
            "image": "startup.jpg",
            "materia": "Eletiva",
            "semestre": "Livre escolha",
            "titulo": "Modelo de negócios para startup nova"
        }
    },
    "Estudos de comportamentos do mundo físico": {
        "Projeto Final de Descronstruindo a Matéria": {
            "descricao": "Em breve...",
            "goal": [
                "Em breve..."
            ],
            "image": "fisica.jpg",
            "materia": "Desconstruindo a Matéria",
            "semestre": "3° Semestre de Engenharia",
            "titulo": "Estudos de comportamentos do mundo físico"
        },
        "Projeto Final de Modelagem e Simulação": {
            "descricao": "O tema do projeto final de Modelagem e Simulação refere-se a um sistema mecânico de segunda ordem que deve ser implementado em Python e apresentado oralmente. Esse projeto reune todos os objetivos de aprendizagem da diciplina de maneira a fazer uma conclusão do curso.",
            "goal": [
                "Criar modelos de diferentes tipos de sistemas, usando diferentes tipos de abstrações.",
                "Implementar solução numérica de modelos de sistemas dinâmicos usando a linguagem de programação Python.",
                "Utilizar as técnicas mais comuns de validação de modelos a partir de dados dos sistemas reais. ",
                "Elaborar conclusões a partir do comportamento observado para os modelos simulados.",
                "Comunicar oralmente, com auxílio de um pôster ou slides, conteúdo técnico."
            ],
            "image": "modsim.jpg",
            "materia": "Modelagem e Simulação do Mundo Físico",
            "semestre": "1° Semestre de Engenharia",
            "titulo": "Projeto Final de Modelagem e Simulação"
        }
    },
    "Estudos sobre Matemática": {
        "Projeto Final de Matemática da Variação": {
            "descricao": "Os alunos se reunem em grupos para estudar e compreender um fenômeno matemático. Os estudantes preparam uma apresentação sobre tal fenômeno e são avaliados com base nesssa. ",
            "goal": [
                "quantificar, interpretar e expressar algébrica e graficamente as taxas de variação média e instantânea de uma grandeza em relação a outra ",
                "interpretar e calcular o valor acumulado de uma variável dependente com a alteração do valor da variável independente ",
                "utilizar os conceitos e ferramentas vistos no curso para criar modelos de situações da realidade, envolvendo principalmente equações diferenciais, com o objetivo de estabelecer previsões e tomar decisões ",
                "utilizar ferramentas da Álgebra Linear para resolver modelos matemáticos originados da caracterização de sistemas dinâmicos ",
                "aprender a aprender matemática, ou seja, deve desenvolver autonomia, em relação ao conhecimento matemático, para buscar fontes de estudo e selecionar métodos que tornem seu aprendizado mais eficiente "
            ],
            "image": "matvar.jpg",
            "materia": "Matemática da Variação",
            "semestre": "2° Semestre de Engenharia",
            "titulo": "Projeto Final de Matemática da Variação"
        },
        "Projeto Final de Matemática Multivariada": {
            "descricao": "Fazer um estudo e escrever um artigo sobre um fenômeno matemática",
            "goal": [
                "Em breve..."
            ],
            "image": "matvar.jpg",
            "materia": "Matemática Multivariada",
            "semestre": "3° Semestre de Engenharia",
            "titulo": "Projeto Final de Matemática Multivariada"
        }
    },
    "Projetos de Programação": {
        "Projeto Final de Design de Software": {
            "descricao": "Como projeto final dessa diciplina, os alunos devem criar um jogo ou um site a partir da programação aprendida em aula. Esse projeto é então apresentado em um feira denominada Demoday.",
            "goal": [
                "Desenvolver programas de computador",
                "Identificar e desenhar estratégias algorítmicas computacionais",
                "Atuar em uma equipe autogerenciada de desenvolvimento"
            ],
            "image": "dsoft.jpg",
            "materia": "Design de Software",
            "semestre": "1° Semestre de Engenharia",
            "titulo": "Projeto Final de Design de Software"
        },
        "Projeto Final de Ciência dos Dados": {
            "descricao": "O projeto é de livre escolha dos alunos, que devem obrigatoriamente usar o ferramental de inferência.",
            "goal": [
                "Elaborar análises exploratórias de dados (univariadas e multivariadas), utilizando ferramentas estatísticas e computacionais adequadas",
                "Especificar as distribuições de probabilidades adequadas para as variáveis quantitativas discretas e contínuas",
                "Conduzir testes inferenciais adequados que possam dar base à tomada de decisão",
                "Analisar relações entre as variáveis, utilizando ferramentas estatísticas inferenciais adequadas"
            ],
            "image": "CD.jpg",
            "materia": "Ciência dos Dados",
            "semestre": "2° Semestre de Engenharia",
            "titulo": "Projeto Final de Ciência dos Dados"
        }
    },
    "Projetos Físicos e Eletrônicos": {
        "Projeto Final de Acionamentos Elétricos": {
            "descricao": "Os alunos são separados em grupos para montar um circuito",
            "goal": [
                "Montar um circuito"
            ],
            "image": "FE.jpg",
            "materia": "Acionamentos Elétricos",
            "semestre": "2° Semestre de Engenharia",
            "titulo": "Projeto Final de Acionamentos Elétricos"
        },
        "Projeto Final de Modelagem e Controle": {
            "descricao": "Em breve...",
            "goal": [
                "Em breve..."
            ],
            "image": "MC.jpg",
            "materia": "Modelagem e Controle",
            "semestre": "4° Semestre de Engenharia",
            "titulo": "Projeto Final de Modelagem e Controle"
        },
        "Estação Metereológica": {
            "descricao": "Usando os conceitos adquiridos durante o semestre, o trabalho visa montar um circuito capaz de medir temperatura, pressão, luminosidade e umidade.",
            "goal": [
                " Aplicar os conceitos de grandeza física e unidade no contexto metrológico, segundo o V.çocabulário Internacional de Metrologia (VIM) e o Sistema Internacional de Unidades (SI)",
                " Utilizar instrumentação básica em eletricidade (multímetros, osciloscópios, fontes e geradores de função)",
                " Projetar circuitos elétricos e eletrônicos e confeccionar placas de circuito impresso dedicadas",
                " Aquisitar dados de fenômenos físicos com o emprego de sensores/transdutores eletroeletrônicos e microcontrolador",
                " Aplicar os conceitos de incerteza, exatidão, precisão, resolução, repetibilidade e sensibilidade nas atividades metrológicas",
                " Analisar e apresentar dados utilizando ferramentas estatísticas básicas"
            ],
            "image": "instrumed1.jpg",
            "materia": "Instrumentação e Medição",
            "semestre": "1° Semestre de Engenharia",
            "titulo": "Estação Metereológica"
        },
        "Girafa do Job Rotation": {
            "descricao": "Para introduzir o curso de Natureza do Design, é proposto o Job Rotation com as principais estações do FabLab (laboratório de ) para a fabricação de uma girafa com iluminação de LED. Esse projeto visa ensinar o funcionamento básico e apresentar as máquinas e ferramentas disponíveis no FabLab.",
            "goal": [
                "Conhecimento das máquinas e ferramentas disponíveis no FabLab (laboratório de)",
                "Utilizar técnicas de fabricaçãoo digital para prototipar soluções",
                "Compreender o projeto de design como forma de aprendizado pelofazer (hands-on)",
                "Entender o trabalho em equipe como importante fator no processo de design, com crescente consciência dos papéis a serem executados durante o projeto"
            ],
            "image": "girafa.jpg",
            "materia": "Natureza do Design",
            "semestre": "1° Semestre de Engenharia",
            "titulo": "Girafa do Job Rotation"
        }
    },
    "Estudos sobre a sociedade": {
        "Cases de Grandes Desafios da Engenharia": {
            "descricao": "Em cada case, um grupo de alunos leciona sobre um tema para o resto da classe. O grupo que leciona é avaliado de acordo com a apresentação feita e o resto da turma é separado em grupos e entrega uma avaliação sobre o assunto apresentado no case. ",
            "goal": [
                "Descrever o processo histórico da Revolução Científica usando a Astronomia como estudo de caso. Identificar os elementos fundamentais do método científico. Apresentar as relações históricas e analíticas entre a Revolução Científica e o Iluminismo.",
                "Descrever o processo histórico da Revolução Científica usando a Astronomia como estudo de caso. Identificar os elementos fundamentais do método científico. Apresentar as relações históricas e analíticas entre a Revolução Científica e o Iluminismo.",
                "Apresentar o conceito de ciência normal. Compreender as relações entre anomalias, paradigmas e revoluções científicas",
                "Apresentar o conceito de ciência normal. Compreender as relações entre anomalias, paradigmas e revoluções científicas",
                "Em grupos de até seis engenheiros e engenheiras, os alunos deverão ser capazes de: Apresentar os conceitos relativos ao método científico, à ciência normal, ao paradigma científico. Articular e aplicar tais conceitos à emergência do paradigma da eletricidade como ramo científico",
                "Apresentar os conceitos de campo científico e de capital científico. Aplicar esses e os demais conceitos anteriormente estudados à compreensão da ciência como construção social",
                "Em grupos de até seis engenheiros e engenheiras, os alunos deverão ser capazes de: Apresentar e relacionar entre si os conceitos de caixa preta, ciência em construção e ciência pronta. Interpretar a descoberta do DNA e a construção do computador Eclipse MV/8000 a partir dos conceitos de caixa preta, ciência em construção e ciência pronta e das quatro máximas de Juno",
                "Distinguir entre determinismo tecnológico e construção social da tecnologia. Apresentar os conceitos relevantes da Social Construction of Technology. Explicar a analogia entre Golem e ciência e tecnologia"
            ],
            "image": "GDE.jpg",
            "materia": "Grandes Desafios da Engenharia",
            "semestre": "1° Semestre de Engenharia",
            "titulo": "Cases de Grandes Desafios da Engenharia"
        }
    }
}